ThisIsNotRocketScience/Syntonovo_PAN/controller/usbmidiio/board/pin_mux.h
/*! @name PIO0_8 (number 64), T3
  @{ */
#define BOARD_INITPINS_T3_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_T3_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_T3_PIN 8U    /*!<@brief 0U pin index: 8 */
                                    /* @} */

/*! @name PIO0_13 (number 67), MK2
  @{ */
#define BOARD_INITPINS_MK2_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_MK2_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_MK2_PIN 13U   /*!<@brief 0U pin index: 13 */
                                     /* @} */

/*! @name PIO1_27 (number 68), T4
  @{ */
#define BOARD_INITPINS_T4_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_T4_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_T4_PIN 27U   /*!<@brief 1U pin index: 27 */
                                    /* @} */

/*! @name PIO0_14 (number 69), BR2
  @{ */
#define BOARD_INITPINS_BR2_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BR2_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_BR2_PIN 14U   /*!<@brief 0U pin index: 14 */
                                     /* @} */

/*! @name PIO0_18 (number 72), MK3
  @{ */
#define BOARD_INITPINS_MK3_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_MK3_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_MK3_PIN 18U   /*!<@brief 0U pin index: 18 */
                                     /* @} */

/*! @name PIO1_28 (number 73), T6
  @{ */
#define BOARD_INITPINS_T6_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_T6_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_T6_PIN 28U   /*!<@brief 1U pin index: 28 */
                                    /* @} */

/*! @name PIO1_19 (number 16), SW2CLK
  @{ */
#define BOARD_INITPINS_SW2CLK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SW2CLK_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SW2CLK_PIN 19U   /*!<@brief 1U pin index: 19 */
                                        /* @} */

/*! @name PIO1_20 (number 17), SW2DATA
  @{ */
#define BOARD_INITPINS_SW2DATA_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SW2DATA_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SW2DATA_PIN 20U   /*!<@brief 1U pin index: 20 */
                                         /* @} */

/*! @name PIO0_15 (number 26), LD1XLAT
  @{ */
#define BOARD_INITPINS_LD1XLAT_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD1XLAT_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD1XLAT_PIN 15U   /*!<@brief 0U pin index: 15 */
                                         /* @} */

/*! @name PIO1_23 (number 46), MK1
  @{ */
#define BOARD_INITPINS_MK1_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_MK1_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_MK1_PIN 23U   /*!<@brief 1U pin index: 23 */
                                     /* @} */

/*! @name PIO0_7 (number 61), SW1CLK
  @{ */
#define BOARD_INITPINS_SW1CLK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SW1CLK_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_SW1CLK_PIN 7U    /*!<@brief 0U pin index: 7 */
                                        /* @} */

/*! @name PIO1_12 (number 62), LD2CLK
  @{ */
#define BOARD_INITPINS_LD2CLK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD2CLK_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_LD2CLK_PIN 12U   /*!<@brief 1U pin index: 12 */
                                        /* @} */

/*! @name PIO0_9 (number 65), SW1DATA
  @{ */
#define BOARD_INITPINS_SW1DATA_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SW1DATA_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_SW1DATA_PIN 9U    /*!<@brief 0U pin index: 9 */
                                         /* @} */

/*! @name PIO1_13 (number 66), LD2DATA
  @{ */
#define BOARD_INITPINS_LD2DATA_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD2DATA_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_LD2DATA_PIN 13U   /*!<@brief 1U pin index: 13 */
                                         /* @} */

/*! @name PIO0_17 (number 70), T5
  @{ */
#define BOARD_INITPINS_T5_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_T5_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_T5_PIN 17U   /*!<@brief 0U pin index: 17 */
                                    /* @} */

/*! @name PIO0_20 (number 74), BR3
  @{ */
#define BOARD_INITPINS_BR3_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BR3_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_BR3_PIN 20U   /*!<@brief 0U pin index: 20 */
                                     /* @} */

/*! @name PIO0_21 (number 77), T7
  @{ */
#define BOARD_INITPINS_T7_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_T7_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_T7_PIN 21U   /*!<@brief 0U pin index: 21 */
                                    /* @} */

/*! @name PIO1_14 (number 78), MK4
  @{ */
#define BOARD_INITPINS_MK4_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_MK4_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_MK4_PIN 14U   /*!<@brief 1U pin index: 14 */
                                     /* @} */

/*! @name PIO0_22 (number 80), BR4
  @{ */
#define BOARD_INITPINS_BR4_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_BR4_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_BR4_PIN 22U   /*!<@brief 0U pin index: 22 */
                                     /* @} */

/*! @name PIO0_3 (number 85), LD1DATA
  @{ */
#define BOARD_INITPINS_LD1DATA_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD1DATA_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD1DATA_PIN 3U    /*!<@brief 0U pin index: 3 */
                                         /* @} */

/*! @name PIO0_5 (number 89), LD2BLANK
  @{ */
#define BOARD_INITPINS_LD2BLANK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD2BLANK_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD2BLANK_PIN 5U    /*!<@brief 0U pin index: 5 */
                                          /* @} */

/*! @name PIO0_6 (number 90), LD1CLK
  @{ */
#define BOARD_INITPINS_LD1CLK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD1CLK_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD1CLK_PIN 6U    /*!<@brief 0U pin index: 6 */
                                        /* @} */

