ThisIsNotRocketScience/Syntonovo_PAN/controller/usbmidiio/board/pin_mux.h
/*! @name PIO0_19 (number 91), SW1LATCH
  @{ */
#define BOARD_INITPINS_SW1LATCH_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SW1LATCH_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_SW1LATCH_PIN 19U   /*!<@brief 0U pin index: 19 */
                                          /* @} */

/*! @name PIO1_31 (number 92), LD2XLAT
  @{ */
#define BOARD_INITPINS_LD2XLAT_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD2XLAT_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_LD2XLAT_PIN 31U   /*!<@brief 1U pin index: 31 */
                                         /* @} */

/*! @name PIO1_11 (number 94), SW2LATCH
  @{ */
#define BOARD_INITPINS_SW2LATCH_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SW2LATCH_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SW2LATCH_PIN 11U   /*!<@brief 1U pin index: 11 */
                                          /* @} */

/*! @name PIO0_1 (number 100), LD1BLANK
  @{ */
#define BOARD_INITPINS_LD1BLANK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LD1BLANK_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LD1BLANK_PIN 1U    /*!<@brief 0U pin index: 1 */
                                          /* @} */

/*! @name PIO1_4 (number 3), LED
  @{ */
#define BOARD_INITPINS_LED_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LED_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_LED_PIN 4U    /*!<@brief 1U pin index: 4 */
                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
